---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.WaveAmplitude
source: html/bafda654-60bf-11d8-d38c-4825dd61bedd.htm
---
# Autodesk.Revit.DB.Visual.Wave.WaveAmplitude Property

The property labeled "Amplitude" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string WaveAmplitude { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 10000".